In [1]:
import pandas as pd
from sklearn.linear_model import LinearRegression

In [2]:
df = pd.read_csv("./data/010 homeprices-201222-125404.csv")

In [39]:
df.head()

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [40]:
df.isnull().sum()

area        0
bedrooms    1
age         0
price       0
dtype: int64

In [41]:
bedroom_median = df["bedrooms"].median()

In [47]:
df = df.fillna(bedroom_median)
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [48]:
X = df.drop("price", axis = 1)
X

   area  bedrooms  age
0  2600       3.0   20
1  3000       4.0   15
2  3200       4.0   18
3  3600       3.0   30
4  4000       5.0    8
5  4100       6.0    8

In [50]:
Y = df["price"]
Y

0    550000
1    565000
2    610000
3    595000
4    760000
5    810000
Name: price, dtype: int64

In [51]:
model = LinearRegression()

In [52]:
model.fit(X.values, Y)

LinearRegression()

In [53]:
model.coef_

array([  112.06244194, 23388.88007794, -3231.71790863])

In [54]:
model.intercept_

221323.00186540396

> Y = -32131.71790*X1 + 112.06*X2 + 23388.88*X3 + 221323

In [58]:
import joblib
joblib.dump(model, "house_predict.pkl")

['house_predict.pkl']